Table of Contents
 Class SteelSetupAUS
Namespace
IdeaRS.OpenModel
Assembly
IdeaRS.OpenModel.dll
Steel setup IBC class
public class SteelSetupAUS : SteelSetup
Inheritance
object
SteelSetup
SteelSetupAUS
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Anchor_Fiar
Safety factor Anchor_Fiar
public double Anchor_Fiar { get; set; }
Property Value
double
 Bolt_Fib
Safety factor Bolt_Fib
public double Bolt_Fib { get; set; }
Property Value
double
 Bolt_Fip
Safety factor preloaded bolt
public double Bolt_Fip { get; set; }
Property Value
double
 CrtBearing
Concrete bearing factor
public double CrtBearing { get; set; }
Property Value
double
 Structural_Fi
Safety factor Structural_Fi
public double Structural_Fi { get; set; }
Property Value
double
 Weld_Fiw
Safety factor Weld_Fiw
public double Weld_Fiw { get; set; }
Property Value
double
Methods
 FrictionCoefficientPboltDefault()
Friction Coefficient Pbolt Default
public override double FrictionCoefficientPboltDefault()
Returns
double
 Edit this page